batuzunoglu/efr32-mlx90640-flame-detector/mlx90640/mlx90640.c
//
#include "stdlib.h" // Required for malloc and free

#include "mlx90640.h"
#include "mlx90640_i2c.h"
#include "math.h"
#include "app_log.h"
#include "sl_sleeptimer.h"
#include "arm_math.h"
static paramsMLX90640 mlx90640;

// -----------------------------------------------------------------------------
//                        Local function declarations
// -----------------------------------------------------------------------------
static void ExtractVDDParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractPTATParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractGainParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractTgcParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractResolutionParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractKsTaParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractKsToParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractAlphaParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractOffsetParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractKtaPixelParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractKvPixelParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractCPParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static void ExtractCILCParameters(uint16_t *eeData, paramsMLX90640 *mlx90640);
static int ExtractDeviatingPixels(uint16_t *eeData, paramsMLX90640 *mlx90640);
static int CheckAdjacentPixels(uint16_t pix1, uint16_t pix2);
static float GetMedian(float *values, int n);
static int IsPixelBad(uint16_t pixel, paramsMLX90640 *params);
static int ValidateFrameData(uint16_t *frameData);
static int ValidateAuxData(uint16_t *auxData);

static float32_t fast_sqrt(float32_t v)
{
  float32_t out;
  arm_sqrt_f32(v, &out);
  return out;
}
// -----------------------------------------------------------------------------
//                           Function definitions
// -----------------------------------------------------------------------------
/***************************************************************************//**
 * Initializes the MLX90640 driver
 ******************************************************************************/
sl_status_t mlx90640_init(sl_i2cspm_t *i2cspm_instance)
{
  int status;
  uint8_t bad_pixel_count = 0;
  uint16_t eeMLX90640[832];

  mlx90640_I2C_Init(i2cspm_instance);

  status = mlx90640_DumpEE(eeMLX90640);
  if (status != 0) {
    app_log("Failed to load system parameters of MLX90640");
  }

  bad_pixel_count = mlx90640_ExtractParameters(eeMLX90640, &mlx90640);
  if (bad_pixel_count != 0) {
    app_log("Number of pixel errors: %d", bad_pixel_count);
  }
  printf("\r\n mlx90640_init Successful..!\n");
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Requests and provides an array of temperatures for all 768 pixels as float values.
 ******************************************************************************/
sl_status_t mlx90640_get_image_array(float *pixel_array)
{
  float Ta;
  for (uint8_t x = 0 ; x < 2; x++) { //Read both sub-pages
    uint16_t mlx90640Frame[834];
    int status = mlx90640_GetFrameData(mlx90640Frame);
    if (status < 0) {
      app_log("GetFrame Error: %d", status);
      return -1;
    }

    mlx90640_GetTa(mlx90640Frame, &mlx90640, &Ta);
    float tr = Ta - TA_SHIFT; //Reflected temperature based on the sensor ambient temperature
    float emissivity = MLX90640_CONFIG_EMISSIVITY;

    mlx90640_CalculateTo(mlx90640Frame, &mlx90640, emissivity, tr, pixel_array);
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Requests and provides the contents of the EEPROM.
 ******************************************************************************/
/*sl_status_t mlx90640_DumpEE(uint16_t *eeData)
{
  return mlx90640_I2CRead(0x2400, 832, eeData);
}*/
sl_status_t mlx90640_DumpEE(uint16_t *eeData)
{
    uint16_t *data = (uint16_t *)malloc(832 * sizeof(uint16_t)); // Heap allocation
    if (data == NULL) {
        return SL_STATUS_FAIL; // Handle allocation failure
    }

    // Perform EEPROM dump (replace i2cRead with actual implementation)
    sl_status_t status = mlx90640_I2CRead(0x2400, 832, data);
    if (status != SL_STATUS_OK) {
        free(data); // Free on failure
        return status;
    }

    // Copy the data to the output array
    memcpy(eeData, data, 832 * sizeof(uint16_t));

    free(data); // Free the allocated memory
    return SL_STATUS_OK;
}


/***************************************************************************//**
 * Waits for a new data to be available with a given slave address
 ******************************************************************************/
sl_status_t mlx90640_SynchFrame(void)
{
  uint16_t dataReady = 0;
  uint16_t statusRegister;
  int error = SL_STATUS_FAIL;

  error = mlx90640_I2CWrite(0x8000, 0x0030);
  if (error == SL_STATUS_FAIL) {
    return SL_STATUS_FAIL;
  }

  while (dataReady == 0) {
    error = mlx90640_I2CRead(0x8000, 1, &statusRegister);
    if (error != 0) {
      return error;
    }
    dataReady = statusRegister & 0x0008;
  }

  return 0;
}

/***************************************************************************//**
 * Uses the global reset command described in the I2C standard to trigger a measurement.
 * !! Note that this function will reset all devices on the same I2C bus that support this command. !!
 ******************************************************************************/
sl_status_t mlx90640_TriggerMeasurement()
{
  int error = 1;
  uint16_t ctrlReg;

  error = mlx90640_I2CRead(0x800D, 1, &ctrlReg);

  if ( error != 0) {
    return error;
  }

  ctrlReg |= 0x8000;
  error = mlx90640_I2CWrite(0x800D, ctrlReg);

  if ( error != 0) {
    return error;
  }

  error = mlx90640_I2CGeneralReset();

  if ( error != 0) {
    return error;
  }

  error = mlx90640_I2CRead(0x800D, 1, &ctrlReg);

  if ( error != 0) {
    return error;
  }

