batuzunoglu/efr32-mlx90640-flame-detector/mlx90640/mlx90640.c
  if ((ctrlReg & 0x8000) != 0) {
    return -9;
  }

  return 0;
}

/***************************************************************************//**
 * Reads all the necessary frame data from the device.
 ******************************************************************************/
sl_status_t mlx90640_GetFrameData(uint16_t *frameData)
{
  uint16_t dataReady = 0;
  uint16_t controlRegister1;
  uint16_t statusRegister;
  int error = 1;
  uint16_t data[64];
  uint8_t cnt = 0;

  while (dataReady == 0) {
    error = mlx90640_I2CRead(0x8000, 1, &statusRegister);
    if (error != 0) {
      return error;
    }
    dataReady = statusRegister & 0x0008;
  }

  error = mlx90640_I2CWrite(0x8000, 0x0030);
  if (error == -1) {
    return error;
  }

  error = mlx90640_I2CRead(0x0400, 768, frameData);
  if (error != 0) {
    return error;
  }

  error = mlx90640_I2CRead(0x0700, 64, data);
  if (error != 0) {
    return error;
  }

  error = mlx90640_I2CRead(0x800D, 1, &controlRegister1);
  frameData[832] = controlRegister1;
  frameData[833] = statusRegister & 0x0001;

  if (error != 0) {
    return error;
  }

  error = ValidateAuxData(data);
  if (error == 0) {
    for (cnt = 0; cnt < 64; cnt++) {
      frameData[cnt + 768] = data[cnt];
    }
  }

  error = ValidateFrameData(frameData);
  if (error != 0) {
    return error;
  }

  return frameData[833];
}

/***************************************************************************//**
 * Validates frame data
 ******************************************************************************/
int ValidateFrameData(uint16_t *frameData)
{
  uint8_t line = 0;

  for (int i = 0; i < 768; i += 32) {
    if ((frameData[i] == 0x7FFF) && (line % 2 == frameData[833])) {
      return -8;
    }
    line = line + 1;
  }

  return 0;
}

/***************************************************************************//**
 * Validates auxiliary data
 ******************************************************************************/
int ValidateAuxData(uint16_t *auxData)
{
  if (auxData[0] == 0x7FFF) {
    return -8;
  }

  for (int i = 8; i < 19; i++) {
    if (auxData[i] == 0x7FFF) {
      return -8;
    }
  }

  for (int i = 20; i < 23; i++) {
    if (auxData[i] == 0x7FFF) {
      return -8;
    }
  }

  for (int i = 24; i < 33; i++) {
    if (auxData[i] == 0x7FFF) {
      return -8;
    }
  }

  for (int i = 40; i < 51; i++) {
    if (auxData[i] == 0x7FFF) {
      return -8;
    }
  }

  for (int i = 52; i < 55; i++) {
    if (auxData[i] == 0x7FFF) {
      return -8;
    }
  }

  for (int i = 56; i < 64; i++) {
    if (auxData[i] == 0x7FFF) {
      return -8;
    }
  }

  return 0;
}

/***************************************************************************//**
 * Extracts the parameters from a given EEPROM data array and stores values
 ******************************************************************************/
sl_status_t mlx90640_ExtractParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  int error = 0;

  ExtractVDDParameters(eeData, mlx90640);
  ExtractPTATParameters(eeData, mlx90640);
  ExtractGainParameters(eeData, mlx90640);
  ExtractTgcParameters(eeData, mlx90640);
  ExtractResolutionParameters(eeData, mlx90640);
  ExtractKsTaParameters(eeData, mlx90640);
  ExtractKsToParameters(eeData, mlx90640);
  ExtractCPParameters(eeData, mlx90640);
  ExtractAlphaParameters(eeData, mlx90640);
  ExtractOffsetParameters(eeData, mlx90640);
  ExtractKtaPixelParameters(eeData, mlx90640);
  ExtractKvPixelParameters(eeData, mlx90640);
  ExtractCILCParameters(eeData, mlx90640);
  error = ExtractDeviatingPixels(eeData, mlx90640);

  return error;
}

/***************************************************************************//**
 * Writes the desired resolution value in order to change the current resolution
 ******************************************************************************/
sl_status_t mlx90640_SetResolution(uint8_t resolution)
{
  uint16_t controlRegister1;
  int value;
  int error;

  value = (resolution & 0x03) << 10;

  error = mlx90640_I2CRead(0x800D, 1, &controlRegister1);

  if (error == 0) {
    value = (controlRegister1 & 0xF3FF) | value;
    error = mlx90640_I2CWrite(0x800D, value);
  }

  return error;
}

/***************************************************************************//**
 * Provides the current resolution.
 ******************************************************************************/
sl_status_t mlx90640_GetCurResolution(uint16_t *currentResolution)
{
  uint16_t controlRegister1;
  int resolutionRAM;
  int error;

  error = mlx90640_I2CRead(0x800D, 1, &controlRegister1);
  if (error != 0) {
    return SL_STATUS_FAIL;
  }
  resolutionRAM = (controlRegister1 & 0x0C00) >> 10;

  *currentResolution = resolutionRAM;
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Writes the desired resolution value in order to change the current refresh rate
 ******************************************************************************/
sl_status_t mlx90640_SetRefreshRate(uint8_t refreshRate)
{
  uint16_t controlRegister1;
  int value;
  int error;

  value = (refreshRate & 0x07) << 7;

  error = mlx90640_I2CRead(0x800D, 1, &controlRegister1);
  if (error == 0) {
    value = (controlRegister1 & 0xFC7F) | value;
    error = mlx90640_I2CWrite(0x800D, value);
  }

  return error;
}

/***************************************************************************//**
 * Provides the current refresh rate.
 ******************************************************************************/
sl_status_t mlx90640_GetRefreshRate(uint16_t *current_rate)
{
  uint16_t controlRegister1;
  int refreshRate;
  int error;

  error = mlx90640_I2CRead(0x800D, 1, &controlRegister1);
  if (error != 0) {
    return SL_STATUS_FAIL;
  }
  refreshRate = (controlRegister1 & 0x0380) >> 7;

  *current_rate = refreshRate;
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Sets device to interleaved mode
 ******************************************************************************/
sl_status_t mlx90640_SetInterleavedMode()
{
  uint16_t controlRegister1;
  int value;
  int error;

  error = mlx90640_I2CRead(0x800D, 1, &controlRegister1);

