batuzunoglu/efr32-mlx90640-flame-detector/mlx90640/mlx90640.c
      kta = params->kta[pixelNumber] / ktaScale;
      kv = params->kv[pixelNumber] / kvScale;
      irData = irData - params->offset[pixelNumber] * (1 + kta * (ta - 25)) * (1 + kv * (vdd - 3.3));

      if (mode !=  params->calibrationModeEE) {
        irData = irData + params->ilChessC[2] * (2 * ilPattern - 1) - params->ilChessC[1] * conversionPattern;
      }

      irData = irData - params->tgc * irDataCP[subPage];

      alphaCompensated = params->alpha[pixelNumber];

      image = irData * alphaCompensated;

      result[pixelNumber] = image;
    }
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Provides the current VDD of the device
 ******************************************************************************/
sl_status_t mlx90640_GetVdd(uint16_t *frameData, const paramsMLX90640 *params, float *vdd)
{
  float temp_vdd;
  float resolutionCorrection;

  int resolutionRAM;

  temp_vdd = frameData[810];
  if (temp_vdd > 32767) {
    temp_vdd = temp_vdd - 65536;
  }
  resolutionRAM = (frameData[832] & 0x0C00) >> 10;
  resolutionCorrection = pow(2, (double)params->resolutionEE) / pow(2, (double)resolutionRAM);
  temp_vdd = (resolutionCorrection * temp_vdd - params->vdd25) / params->kVdd + 3.3;

  *vdd = temp_vdd;
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Provides the current Ta of the device
 ******************************************************************************/
sl_status_t mlx90640_GetTa(uint16_t *frameData, const paramsMLX90640 *params, float *ta)
{
  float ptat;
  float ptatArt;
  float vdd;
  float temp_ta;

  mlx90640_GetVdd(frameData, params, &vdd);

  ptat = frameData[800];
  if (ptat > 32767) {
    ptat = ptat - 65536;
  }

  ptatArt = frameData[768];
  if (ptatArt > 32767) {
    ptatArt = ptatArt - 65536;
  }
  ptatArt = (ptat / (ptat * params->alphaPTAT + ptatArt)) * pow(2, (double)18);

  temp_ta = (ptatArt / (1 + params->KvPTAT * (vdd - 3.3)) - params->vPTAT25);
  temp_ta = temp_ta / params->KtPTAT + 25;

  *ta = temp_ta;
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Provides the sub-page for a selected frame data
 ******************************************************************************/
sl_status_t mlx90640_GetSubPageNumber(uint16_t *frameData)
{
  return frameData[833];
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Corrects the values of the broken pixels and/or the outlier pixels.
 ******************************************************************************/
sl_status_t mlx90640_BadPixelsCorrection(uint16_t *pixels, float *to, int mode, paramsMLX90640 *params)
{
  float ap[4];
  uint8_t pix;
  uint8_t line;
  uint8_t column;

  pix = 0;
  while (pixels[pix] != 0xFFFF) {
    line = pixels[pix] >> 5;
    column = pixels[pix] - (line << 5);

    if (mode == 1) {
      if (line == 0) {
        if (column == 0) {
          to[pixels[pix]] = to[33];
        } else if (column == 31) {
          to[pixels[pix]] = to[62];
        } else {
          to[pixels[pix]] = (to[pixels[pix] + 31] + to[pixels[pix] + 33]) / 2.0;
        }
      } else if (line == 23) {
        if (column == 0) {
          to[pixels[pix]] = to[705];
        } else if (column == 31) {
          to[pixels[pix]] = to[734];
        } else {
          to[pixels[pix]] = (to[pixels[pix] - 33] + to[pixels[pix] - 31]) / 2.0;
        }
      } else if (column == 0) {
        to[pixels[pix]] = (to[pixels[pix] - 31] + to[pixels[pix] + 33]) / 2.0;
      } else if (column == 31) {
        to[pixels[pix]] = (to[pixels[pix] - 33] + to[pixels[pix] + 31]) / 2.0;
      } else {
        ap[0] = to[pixels[pix] - 33];
        ap[1] = to[pixels[pix] - 31];
        ap[2] = to[pixels[pix] + 31];
        ap[3] = to[pixels[pix] + 33];
        to[pixels[pix]] = GetMedian(ap, 4);
      }
    } else {
      if (column == 0) {
        to[pixels[pix]] = to[pixels[pix] + 1];
      } else if (column == 1 || column == 30) {
        to[pixels[pix]] = (to[pixels[pix] - 1] + to[pixels[pix] + 1]) / 2.0;
      } else if (column == 31) {
        to[pixels[pix]] = to[pixels[pix] - 1];
      } else {
        if (IsPixelBad(pixels[pix] - 2, params) == 0 && IsPixelBad(pixels[pix] + 2, params) == 0) {
          ap[0] = to[pixels[pix] + 1] - to[pixels[pix] + 2];
          ap[1] = to[pixels[pix] - 1] - to[pixels[pix] - 2];
          if (fabs(ap[0]) > fabs(ap[1])) {
            to[pixels[pix]] = to[pixels[pix] - 1] + ap[1];
          } else {
            to[pixels[pix]] = to[pixels[pix] + 1] + ap[0];
          }
        } else {
          to[pixels[pix]] = (to[pixels[pix] - 1] + to[pixels[pix] + 1]) / 2.0;
        }
      }
    }
    pix = pix + 1;
  }
  return SL_STATUS_OK;
}

//------------------------------------------------------------------------------

void ExtractVDDParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  int16_t kVdd;
  int16_t vdd25;

  kVdd = eeData[51];

  kVdd = (eeData[51] & 0xFF00) >> 8;
  if (kVdd > 127) {
    kVdd = kVdd - 256;
  }
  kVdd = 32 * kVdd;
  vdd25 = eeData[51] & 0x00FF;
  vdd25 = ((vdd25 - 256) << 5) - 8192;

  mlx90640->kVdd = kVdd;
  mlx90640->vdd25 = vdd25;
}

//------------------------------------------------------------------------------

void ExtractPTATParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  float KvPTAT;
  float KtPTAT;
  int16_t vPTAT25;
  float alphaPTAT;

  KvPTAT = (eeData[50] & 0xFC00) >> 10;
  if (KvPTAT > 31) {
    KvPTAT = KvPTAT - 64;
  }
  KvPTAT = KvPTAT / 4096;

  KtPTAT = eeData[50] & 0x03FF;
  if (KtPTAT > 511) {
    KtPTAT = KtPTAT - 1024;
  }
  KtPTAT = KtPTAT / 8;

  vPTAT25 = eeData[49];

  alphaPTAT = (eeData[16] & 0xF000) / pow(2, (double)14) + 8.0f;

  mlx90640->KvPTAT = KvPTAT;
  mlx90640->KtPTAT = KtPTAT;
  mlx90640->vPTAT25 = vPTAT25;
  mlx90640->alphaPTAT = alphaPTAT;
}

//------------------------------------------------------------------------------

void ExtractGainParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  int16_t gainEE;

  gainEE = eeData[48];
  if (gainEE > 32767) {
    gainEE = gainEE - 65536;
  }

  mlx90640->gainEE = gainEE;
}

//------------------------------------------------------------------------------

void ExtractTgcParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  float tgc;
  tgc = eeData[60] & 0x00FF;
  if (tgc > 127) {
    tgc = tgc - 256;
  }
  tgc = tgc / 32.0f;

  mlx90640->tgc = tgc;
}

//------------------------------------------------------------------------------

void ExtractResolutionParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  uint8_t resolutionEE;
  resolutionEE = (eeData[56] & 0x3000) >> 12;

  mlx90640->resolutionEE = resolutionEE;
}

//------------------------------------------------------------------------------

