batuzunoglu/efr32-mlx90640-flame-detector/mlx90640/mlx90640.c
void ExtractKsTaParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  float KsTa;
  KsTa = (eeData[60] & 0xFF00) >> 8;
  if (KsTa > 127) {
    KsTa = KsTa - 256;
  }
  KsTa = KsTa / 8192.0f;

  mlx90640->KsTa = KsTa;
}

//------------------------------------------------------------------------------

void ExtractKsToParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  int32_t KsToScale;
  int8_t step;

  step = ((eeData[63] & 0x3000) >> 12) * 10;

  mlx90640->ct[0] = -40;
  mlx90640->ct[1] = 0;
  mlx90640->ct[2] = (eeData[63] & 0x00F0) >> 4;
  mlx90640->ct[3] = (eeData[63] & 0x0F00) >> 8;

  mlx90640->ct[2] = mlx90640->ct[2] * step;
  mlx90640->ct[3] = mlx90640->ct[2] + mlx90640->ct[3] * step;
  mlx90640->ct[4] = 400;

  KsToScale = (eeData[63] & 0x000F) + 8;
  KsToScale = 1UL << KsToScale;

  mlx90640->ksTo[0] = eeData[61] & 0x00FF;
  mlx90640->ksTo[1] = (eeData[61] & 0xFF00) >> 8;
  mlx90640->ksTo[2] = eeData[62] & 0x00FF;
  mlx90640->ksTo[3] = (eeData[62] & 0xFF00) >> 8;

  for (int i = 0; i < 4; i++) {
    if (mlx90640->ksTo[i] > 127) {
      mlx90640->ksTo[i] = mlx90640->ksTo[i] - 256;
    }
    mlx90640->ksTo[i] = mlx90640->ksTo[i] / KsToScale;
  }

  mlx90640->ksTo[4] = -0.0002;
}

//------------------------------------------------------------------------------

void ExtractAlphaParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  /*int accRow[24];
  int accColumn[32];
  int p = 0;
  int alphaRef;
  uint8_t alphaScale;
  uint8_t accRowScale;
  uint8_t accColumnScale;
  uint8_t accRemScale;
  float alphaTemp[768];
  float temp;

  accRemScale = eeData[32] & 0x000F;
  accColumnScale = (eeData[32] & 0x00F0) >> 4;
  accRowScale = (eeData[32] & 0x0F00) >> 8;
  alphaScale = ((eeData[32] & 0xF000) >> 12) + 30;
  alphaRef = eeData[33];*/
  int accRow[24];
  int accColumn[32];
  float *alphaTemp = (float *)malloc(768 * sizeof(float)); // Allocate on heap
  if (alphaTemp == NULL) {
      return; // Handle memory allocation failure
  }

  int p = 0;
  int alphaRef;
  uint8_t alphaScale;
  uint8_t accRowScale;
  uint8_t accColumnScale;
  uint8_t accRemScale;
  float temp;

  accRemScale = eeData[32] & 0x000F;
  accColumnScale = (eeData[32] & 0x00F0) >> 4;
  accRowScale = (eeData[32] & 0x0F00) >> 8;
  alphaScale = ((eeData[32] & 0xF000) >> 12) + 30;
  alphaRef = eeData[33];


  for (int i = 0; i < 6; i++) {
    p = i * 4;
    accRow[p + 0] = (eeData[34 + i] & 0x000F);
    accRow[p + 1] = (eeData[34 + i] & 0x00F0) >> 4;
    accRow[p + 2] = (eeData[34 + i] & 0x0F00) >> 8;
    accRow[p + 3] = (eeData[34 + i] & 0xF000) >> 12;
  }

  for (int i = 0; i < 24; i++) {
    if (accRow[i] > 7) {
      accRow[i] = accRow[i] - 16;
    }
  }

  for (int i = 0; i < 8; i++) {
    p = i * 4;
    accColumn[p + 0] = (eeData[40 + i] & 0x000F);
    accColumn[p + 1] = (eeData[40 + i] & 0x00F0) >> 4;
    accColumn[p + 2] = (eeData[40 + i] & 0x0F00) >> 8;
    accColumn[p + 3] = (eeData[40 + i] & 0xF000) >> 12;
  }

  for (int i = 0; i < 32; i++) {
    if (accColumn[i] > 7) {
      accColumn[i] = accColumn[i] - 16;
    }
  }

  for (int i = 0; i < 24; i++) {
    for (int j = 0; j < 32; j++) {
      p = 32 * i + j;
      alphaTemp[p] = (eeData[64 + p] & 0x03F0) >> 4;
      if (alphaTemp[p] > 31) {
        alphaTemp[p] = alphaTemp[p] - 64;
      }
      alphaTemp[p] = alphaTemp[p] * (1 << accRemScale);
      alphaTemp[p] = (alphaRef + (accRow[i] << accRowScale) + (accColumn[j] << accColumnScale) + alphaTemp[p]);
      alphaTemp[p] = alphaTemp[p] / pow(2, (double)alphaScale);
      alphaTemp[p] = alphaTemp[p] - mlx90640->tgc * (mlx90640->cpAlpha[0] + mlx90640->cpAlpha[1]) / 2;
      alphaTemp[p] = SCALEALPHA / alphaTemp[p];
    }
  }

  temp = alphaTemp[0];
  for (int i = 1; i < 768; i++) {
    if (alphaTemp[i] > temp) {
      temp = alphaTemp[i];
    }
  }

  alphaScale = 0;
  while (temp < 32767.4) {
    temp = temp * 2;
    alphaScale = alphaScale + 1;
  }

  for (int i = 0; i < 768; i++) {
    temp = alphaTemp[i] * pow(2, (double)alphaScale);
    mlx90640->alpha[i] = (temp + 0.5);
  }
  mlx90640->alphaScale = alphaScale;
  free(alphaTemp); // Free memory after use
}

/***************************************************************************//**
 *
 ******************************************************************************/
void ExtractOffsetParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  int occRow[24];
  int occColumn[32];
  int p = 0;
  int16_t offsetRef;
  uint8_t occRowScale;
  uint8_t occColumnScale;
  uint8_t occRemScale;

  occRemScale = (eeData[16] & 0x000F);
  occColumnScale = (eeData[16] & 0x00F0) >> 4;
  occRowScale = (eeData[16] & 0x0F00) >> 8;
  offsetRef = eeData[17];
  if (offsetRef > 32767) {
    offsetRef = offsetRef - 65536;
  }

  for (int i = 0; i < 6; i++) {
    p = i * 4;
    occRow[p + 0] = (eeData[18 + i] & 0x000F);
    occRow[p + 1] = (eeData[18 + i] & 0x00F0) >> 4;
    occRow[p + 2] = (eeData[18 + i] & 0x0F00) >> 8;
    occRow[p + 3] = (eeData[18 + i] & 0xF000) >> 12;
  }

  for (int i = 0; i < 24; i++) {
    if (occRow[i] > 7) {
      occRow[i] = occRow[i] - 16;
    }
  }

  for (int i = 0; i < 8; i++) {
    p = i * 4;
    occColumn[p + 0] = (eeData[24 + i] & 0x000F);
    occColumn[p + 1] = (eeData[24 + i] & 0x00F0) >> 4;
    occColumn[p + 2] = (eeData[24 + i] & 0x0F00) >> 8;
    occColumn[p + 3] = (eeData[24 + i] & 0xF000) >> 12;
  }

  for (int i = 0; i < 32; i++) {
    if (occColumn[i] > 7) {
      occColumn[i] = occColumn[i] - 16;
    }
  }

  for (int i = 0; i < 24; i++) {
    for (int j = 0; j < 32; j++) {
      p = 32 * i + j;
      mlx90640->offset[p] = (eeData[64 + p] & 0xFC00) >> 10;
      if (mlx90640->offset[p] > 31) {
        mlx90640->offset[p] = mlx90640->offset[p] - 64;
      }
      mlx90640->offset[p] = mlx90640->offset[p] * (1 << occRemScale);
      mlx90640->offset[p] = (offsetRef + (occRow[i] << occRowScale) + (occColumn[j] << occColumnScale) + mlx90640->offset[p]);
    }
  }
}

/***************************************************************************//**
 *
 ******************************************************************************/
void ExtractKtaPixelParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
    float *ktaTemp = (float *)malloc(768 * sizeof(float)); // Allocate on heap
    if (ktaTemp == NULL) {
        printf("\r\n Handle memory allocation failure!\n");
        return;
    }

    int p = 0;
    int8_t KtaRC[4];
    int8_t KtaRoCo;
    int8_t KtaRoCe;
    int8_t KtaReCo;
    int8_t KtaReCe;
    uint8_t ktaScale1;
    uint8_t ktaScale2;
    uint8_t split;
    float temp;

    // Extract parameters
    KtaRoCo = (eeData[54] & 0xFF00) >> 8;
    if (KtaRoCo > 127) {
        KtaRoCo -= 256;
    }
    KtaRC[0] = KtaRoCo;

    KtaReCo = (eeData[54] & 0x00FF);
    if (KtaReCo > 127) {
        KtaReCo -= 256;
    }
    KtaRC[2] = KtaReCo;

    KtaRoCe = (eeData[55] & 0xFF00) >> 8;
    if (KtaRoCe > 127) {
        KtaRoCe -= 256;
    }
    KtaRC[1] = KtaRoCe;

    KtaReCe = (eeData[55] & 0x00FF);
    if (KtaReCe > 127) {
        KtaReCe -= 256;
    }
    KtaRC[3] = KtaReCe;

