batuzunoglu/efr32-mlx90640-flame-detector/mlx90640/mlx90640.c
    ktaScale1 = ((eeData[56] & 0x00F0) >> 4) + 8;
    ktaScale2 = (eeData[56] & 0x000F);

    for (int i = 0; i < 24; i++) {
        for (int j = 0; j < 32; j++) {
            p = 32 * i + j;
            split = 2 * (p / 32 - (p / 64) * 2) + p % 2;
            ktaTemp[p] = (eeData[64 + p] & 0x000E) >> 1;
            if (ktaTemp[p] > 3) {
                ktaTemp[p] -= 8;
            }
            ktaTemp[p] *= (1 << ktaScale2);
            ktaTemp[p] = KtaRC[split] + ktaTemp[p];
            ktaTemp[p] /= pow(2, (double)ktaScale1);
        }
    }

    temp = fabs(ktaTemp[0]);
    for (int i = 1; i < 768; i++) {
        if (fabs(ktaTemp[i]) > temp) {
            temp = fabs(ktaTemp[i]);
        }
    }

    ktaScale1 = 0;
    while (temp < 63.4) {
        temp *= 2;
        ktaScale1++;
    }

    for (int i = 0; i < 768; i++) {
        temp = ktaTemp[i] * pow(2, (double)ktaScale1);
        if (temp < 0) {
            mlx90640->kta[i] = (temp - 0.5);
        } else {
            mlx90640->kta[i] = (temp + 0.5);
        }
    }
    mlx90640->ktaScale = ktaScale1;

    free(ktaTemp); // Free the dynamically allocated memory
}


/***************************************************************************//**
 *
 ******************************************************************************/
void ExtractKvPixelParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  float *kvTemp = (float *)malloc(768 * sizeof(float)); // Allocate on heap
  if (kvTemp == NULL) {
      printf("\r\n kvTemp[768] Handle memory allocation failure!\n");
      return;
  }
  int p = 0;
  int8_t KvT[4];
  int8_t KvRoCo;
  int8_t KvRoCe;
  int8_t KvReCo;
  int8_t KvReCe;
  uint8_t kvScale;
  uint8_t split;
  //float kvTemp[768];
  float temp;

  KvRoCo = (eeData[52] & 0xF000) >> 12;
  if (KvRoCo > 7) {
    KvRoCo = KvRoCo - 16;
  }
  KvT[0] = KvRoCo;

  KvReCo = (eeData[52] & 0x0F00) >> 8;
  if (KvReCo > 7) {
    KvReCo = KvReCo - 16;
  }
  KvT[2] = KvReCo;

  KvRoCe = (eeData[52] & 0x00F0) >> 4;
  if (KvRoCe > 7) {
    KvRoCe = KvRoCe - 16;
  }
  KvT[1] = KvRoCe;

  KvReCe = (eeData[52] & 0x000F);
  if (KvReCe > 7) {
    KvReCe = KvReCe - 16;
  }
  KvT[3] = KvReCe;

  kvScale = (eeData[56] & 0x0F00) >> 8;

  for (int i = 0; i < 24; i++) {
    for (int j = 0; j < 32; j++) {
      p = 32 * i + j;
      split = 2 * (p / 32 - (p / 64) * 2) + p % 2;
      kvTemp[p] = KvT[split];
      kvTemp[p] = kvTemp[p] / pow(2, (double)kvScale);
    }
  }

  temp = fabs(kvTemp[0]);
  for (int i = 1; i < 768; i++) {
    if (fabs(kvTemp[i]) > temp) {
      temp = fabs(kvTemp[i]);
    }
  }

  kvScale = 0;
  while (temp < 63.4) {
    temp = temp * 2;
    kvScale = kvScale + 1;
  }

  for (int i = 0; i < 768; i++) {
    temp = kvTemp[i] * pow(2, (double)kvScale);
    if (temp < 0) {
      mlx90640->kv[i] = (temp - 0.5);
    } else {
      mlx90640->kv[i] = (temp + 0.5);
    }
  }
  mlx90640->kvScale = kvScale;
}

/***************************************************************************//**
 *
 ******************************************************************************/
void ExtractCPParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  float alphaSP[2];
  int16_t offsetSP[2];
  float cpKv;
  float cpKta;
  uint8_t alphaScale;
  uint8_t ktaScale1;
  uint8_t kvScale;

  alphaScale = ((eeData[32] & 0xF000) >> 12) + 27;

  offsetSP[0] = (eeData[58] & 0x03FF);
  if (offsetSP[0] > 511) {
    offsetSP[0] = offsetSP[0] - 1024;
  }

  offsetSP[1] = (eeData[58] & 0xFC00) >> 10;
  if (offsetSP[1] > 31) {
    offsetSP[1] = offsetSP[1] - 64;
  }
  offsetSP[1] = offsetSP[1] + offsetSP[0];

  alphaSP[0] = (eeData[57] & 0x03FF);
  if (alphaSP[0] > 511) {
    alphaSP[0] = alphaSP[0] - 1024;
  }
  alphaSP[0] = alphaSP[0] /  pow(2, (double)alphaScale);

  alphaSP[1] = (eeData[57] & 0xFC00) >> 10;
  if (alphaSP[1] > 31) {
    alphaSP[1] = alphaSP[1] - 64;
  }
  alphaSP[1] = (1 + alphaSP[1] / 128) * alphaSP[0];

  cpKta = (eeData[59] & 0x00FF);
  if (cpKta > 127) {
    cpKta = cpKta - 256;
  }
  ktaScale1 = ((eeData[56] & 0x00F0) >> 4) + 8;
  mlx90640->cpKta = cpKta / pow(2, (double)ktaScale1);

  cpKv = (eeData[59] & 0xFF00) >> 8;
  if (cpKv > 127) {
    cpKv = cpKv - 256;
  }
  kvScale = (eeData[56] & 0x0F00) >> 8;
  mlx90640->cpKv = cpKv / pow(2, (double)kvScale);

  mlx90640->cpAlpha[0] = alphaSP[0];
  mlx90640->cpAlpha[1] = alphaSP[1];
  mlx90640->cpOffset[0] = offsetSP[0];
  mlx90640->cpOffset[1] = offsetSP[1];
}

/***************************************************************************//**
 *
 ******************************************************************************/
void ExtractCILCParameters(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  float ilChessC[3];
  uint8_t calibrationModeEE;

  calibrationModeEE = (eeData[10] & 0x0800) >> 4;
  calibrationModeEE = calibrationModeEE ^ 0x80;

  ilChessC[0] = (eeData[53] & 0x003F);
  if (ilChessC[0] > 31) {
    ilChessC[0] = ilChessC[0] - 64;
  }
  ilChessC[0] = ilChessC[0] / 16.0f;

  ilChessC[1] = (eeData[53] & 0x07C0) >> 6;
  if (ilChessC[1] > 15) {
    ilChessC[1] = ilChessC[1] - 32;
  }
  ilChessC[1] = ilChessC[1] / 2.0f;

  ilChessC[2] = (eeData[53] & 0xF800) >> 11;
  if (ilChessC[2] > 15) {
    ilChessC[2] = ilChessC[2] - 32;
  }
  ilChessC[2] = ilChessC[2] / 8.0f;

  mlx90640->calibrationModeEE = calibrationModeEE;
  mlx90640->ilChessC[0] = ilChessC[0];
  mlx90640->ilChessC[1] = ilChessC[1];
  mlx90640->ilChessC[2] = ilChessC[2];
}

/***************************************************************************//**
 *
 ******************************************************************************/
int ExtractDeviatingPixels(uint16_t *eeData, paramsMLX90640 *mlx90640)
{
  uint16_t pixCnt = 0;
  uint16_t brokenPixCnt = 0;
  uint16_t outlierPixCnt = 0;
  int warn = 0;
  int i;

  for (pixCnt = 0; pixCnt < 5; pixCnt++) {
    mlx90640->brokenPixels[pixCnt] = 0xFFFF;
    mlx90640->outlierPixels[pixCnt] = 0xFFFF;
  }

  pixCnt = 0;
  while (pixCnt < 768 && brokenPixCnt < 5 && outlierPixCnt < 5) {
    if (eeData[pixCnt + 64] == 0) {
      mlx90640->brokenPixels[brokenPixCnt] = pixCnt;
      brokenPixCnt = brokenPixCnt + 1;
    } else if ((eeData[pixCnt + 64] & 0x0001) != 0) {
      mlx90640->outlierPixels[outlierPixCnt] = pixCnt;
      outlierPixCnt = outlierPixCnt + 1;
    }
    pixCnt = pixCnt + 1;
  }

  if (brokenPixCnt > 4) {
    warn = -3;
  } else if (outlierPixCnt > 4) {
    warn = -4;
  } else if ((brokenPixCnt + outlierPixCnt) > 4) {
    warn = -5;
  } else {
    for (pixCnt = 0; pixCnt < brokenPixCnt; pixCnt++) {
      for (i = pixCnt + 1; i < brokenPixCnt; i++) {
        warn = CheckAdjacentPixels(mlx90640->brokenPixels[pixCnt], mlx90640->brokenPixels[i]);
        if (warn != 0) {
          return warn;
        }
      }
    }

    for (pixCnt = 0; pixCnt < outlierPixCnt; pixCnt++) {
      for (i = pixCnt + 1; i < outlierPixCnt; i++) {
        warn = CheckAdjacentPixels(mlx90640->outlierPixels[pixCnt], mlx90640->outlierPixels[i]);
        if (warn != 0) {
          return warn;
        }
      }
    }

    for (pixCnt = 0; pixCnt < brokenPixCnt; pixCnt++) {
      for (i = 0; i < outlierPixCnt; i++) {
        warn = CheckAdjacentPixels(mlx90640->brokenPixels[pixCnt], mlx90640->outlierPixels[i]);
        if (warn != 0) {
          return warn;
        }
      }
    }
  }
  return warn;
}

/***************************************************************************//**
 *
 ******************************************************************************/
int CheckAdjacentPixels(uint16_t pix1, uint16_t pix2)
{
  int pixPosDif;

  pixPosDif = pix1 - pix2;
  if (pixPosDif > -34 && pixPosDif < -30) {
    return -6;
  }
  if (pixPosDif > -2 && pixPosDif < 2) {
    return -6;
  }
  if (pixPosDif > 30 && pixPosDif < 34) {
    return -6;
  }

  return 0;
}

/***************************************************************************//**
 *
 ******************************************************************************/
float GetMedian(float *values, int n)
{
  float temp;

  for (int i = 0; i < n - 1; i++) {
    for (int j = i + 1; j < n; j++) {
      if (values[j] < values[i]) {
        temp = values[i];
        values[i] = values[j];
        values[j] = temp;
      }
    }
  }

  if (n % 2 == 0) {
    return ((values[n / 2] + values[n / 2 - 1]) / 2.0);
  } else {
    return values[n / 2];
  }
}

/***************************************************************************//**
 *
 ******************************************************************************/
int IsPixelBad(uint16_t pixel, paramsMLX90640 *params)
{
  for (int i = 0; i < 5; i++) {
    if (pixel == params->outlierPixels[i] || pixel == params->brokenPixels[i]) {
      return 1;
    }
  }

  return 0;
}
